{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<|im_start|>",
  "clean_up_tokenization_spaces": false,
  "end_of_utterance_token": "<end_of_utterance>",
  "eos_token": "<end_of_utterance>",
  "errors": "replace",
  "extra_special_tokens": [
    "<action_0>",
    "<action_1>",
    "<action_2>",
    "<action_3>",
    "<action_4>",
    "<action_5>",
    "<action_6>",
    "<action_7>",
    "<action_8>",
    "<action_9>",
    "<action_10>",
    "<action_11>",
    "<action_12>",
    "<action_13>",
    "<action_14>",
    "<action_15>",
    "<action_16>",
    "<action_17>",
    "<action_18>",
    "<action_19>",
    "<action_20>",
    "<action_21>",
    "<action_22>",
    "<action_23>",
    "<action_24>",
    "<action_25>",
    "<action_26>",
    "<action_27>",
    "<action_28>",
    "<action_29>",
    "<action_30>",
    "<action_31>",
    "<action_32>",
    "<action_33>",
    "<action_34>",
    "<action_35>",
    "<action_36>",
    "<action_37>",
    "<action_38>",
    "<action_39>",
    "<action_40>",
    "<action_41>",
    "<action_42>",
    "<action_43>",
    "<action_44>",
    "<action_45>",
    "<action_46>",
    "<action_47>",
    "<action_48>",
    "<action_49>",
    "<action_50>",
    "<action_51>",
    "<action_52>",
    "<action_53>",
    "<action_54>",
    "<action_55>",
    "<action_56>",
    "<action_57>",
    "<action_58>",
    "<action_59>",
    "<action_60>",
    "<action_61>",
    "<action_62>",
    "<action_63>",
    "<action_64>",
    "<action_65>",
    "<action_66>",
    "<action_67>",
    "<action_68>",
    "<action_69>",
    "<action_70>",
    "<action_71>",
    "<action_72>",
    "<action_73>",
    "<action_74>",
    "<action_75>",
    "<action_76>",
    "<action_77>",
    "<action_78>",
    "<action_79>",
    "<action_80>",
    "<action_81>",
    "<action_82>",
    "<action_83>",
    "<action_84>",
    "<action_85>",
    "<action_86>",
    "<action_87>",
    "<action_88>",
    "<action_89>",
    "<action_90>",
    "<action_91>",
    "<action_92>",
    "<action_93>",
    "<action_94>",
    "<action_95>",
    "<action_96>",
    "<action_97>",
    "<action_98>",
    "<action_99>",
    "<action_100>",
    "<action_101>",
    "<action_102>",
    "<action_103>",
    "<action_104>",
    "<action_105>",
    "<action_106>",
    "<action_107>",
    "<action_108>",
    "<action_109>",
    "<action_110>",
    "<action_111>",
    "<action_112>",
    "<action_113>",
    "<action_114>",
    "<action_115>",
    "<action_116>",
    "<action_117>",
    "<action_118>",
    "<action_119>",
    "<action_120>",
    "<action_121>",
    "<action_122>",
    "<action_123>",
    "<action_124>",
    "<action_125>",
    "<action_126>",
    "<action_127>",
    "<action_128>",
    "<action_129>",
    "<action_130>",
    "<action_131>",
    "<action_132>",
    "<action_133>",
    "<action_134>",
    "<action_135>",
    "<action_136>",
    "<action_137>",
    "<action_138>",
    "<action_139>",
    "<action_140>",
    "<action_141>",
    "<action_142>",
    "<action_143>",
    "<action_144>",
    "<action_145>",
    "<action_146>",
    "<action_147>",
    "<action_148>",
    "<action_149>",
    "<action_150>",
    "<action_151>",
    "<action_152>",
    "<action_153>",
    "<action_154>",
    "<action_155>",
    "<action_156>",
    "<action_157>",
    "<action_158>",
    "<action_159>",
    "<action_160>",
    "<action_161>",
    "<action_162>",
    "<action_163>",
    "<action_164>",
    "<action_165>",
    "<action_166>",
    "<action_167>",
    "<action_168>",
    "<action_169>",
    "<action_170>",
    "<action_171>",
    "<action_172>",
    "<action_173>",
    "<action_174>",
    "<action_175>",
    "<action_176>",
    "<action_177>",
    "<action_178>",
    "<action_179>",
    "<action_180>",
    "<action_181>",
    "<action_182>",
    "<action_183>",
    "<action_184>",
    "<action_185>",
    "<action_186>",
    "<action_187>",
    "<action_188>",
    "<action_189>",
    "<action_190>",
    "<action_191>",
    "<action_192>",
    "<action_193>",
    "<action_194>",
    "<action_195>",
    "<action_196>",
    "<action_197>",
    "<action_198>",
    "<action_199>",
    "<action_200>",
    "<action_201>",
    "<action_202>",
    "<action_203>",
    "<action_204>",
    "<action_205>",
    "<action_206>",
    "<action_207>",
    "<action_208>",
    "<action_209>",
    "<action_210>",
    "<action_211>",
    "<action_212>",
    "<action_213>",
    "<action_214>",
    "<action_215>",
    "<action_216>",
    "<action_217>",
    "<action_218>",
    "<action_219>",
    "<action_220>",
    "<action_221>",
    "<action_222>",
    "<action_223>",
    "<action_224>",
    "<action_225>",
    "<action_226>",
    "<action_227>",
    "<action_228>",
    "<action_229>",
    "<action_230>",
    "<action_231>",
    "<action_232>",
    "<action_233>",
    "<action_234>",
    "<action_235>",
    "<action_236>",
    "<action_237>",
    "<action_238>",
    "<action_239>",
    "<action_240>",
    "<action_241>",
    "<action_242>",
    "<action_243>",
    "<action_244>",
    "<action_245>",
    "<action_246>",
    "<action_247>",
    "<action_248>",
    "<action_249>",
    "<action_250>",
    "<action_251>",
    "<action_252>",
    "<action_253>",
    "<action_254>",
    "<action_255>"
  ],
  "fake_image_token": "<fake_token_around_image>",
  "global_image_token": "<global-img>",
  "image_token": "<image>",
  "is_local": false,
  "legacy": false,
  "local_files_only": false,
  "model_max_length": 8192,
  "model_specific_special_tokens": {
    "end_of_utterance_token": "<end_of_utterance>",
    "fake_image_token": "<fake_token_around_image>",
    "global_image_token": "<global-img>",
    "image_token": "<image>"
  },
  "pad_token": "<|im_end|>",
  "processor_class": "SmolVLMProcessor",
  "tokenizer_class": "GPT2Tokenizer",
  "truncation_side": "left",
  "unk_token": "<|endoftext|>",
  "vocab_size": 49152
}
